//{{ job_owner }}B JOB (ACCT),'DB2 QUERY',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//STEP1    EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD DISP=SHR,DSN={{ db2_subsystem }}.SDSNEXIT
//         DD DISP=SHR,DSN=DB2V13.SDSNLOAD
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
 DSN SYSTEM({{ db2_subsystem }})
 RUN PROGRAM(DSNTEP2) PLAN(DSNTEP2) -
     LIB('DBD1.RUNLIB.LOAD')
 END
/*
//SYSIN DD *
{{ sql }}
/*